# Projeto Integrador - Grupo 4

## 1.Definição do problema a ser atacado

#### _O Brasil apresenta baixa eficiência nos resultados de educação mesmo com investimento(% do PIB) superior aos países G7._

## 2.Coleta de dados e informações

De acordo com os dados levantados pela Organização para a Cooperação e Desenvolvimento Econômico(OCDE ou OECD em inglês) o Brasil figura entre os sete maiores investidores em Educação relativo ao seu PIB totalizando 5% do PIB, ficando à frente de países desenvolvidos como EUA, Canadá e Reino Unido, porém quando comparado com os resultados do PISA(Programme for International Student Assessment) o Brasil figura entre os últimos sendo comparado à Indonésia que investe 3% do seu PIB em Educação. Analisando o gráfico de despesa por aluno o Brasil figura entre os últimos comparado com a Indonésia[1]. O que causa essa disparidade?

<img src='img/InvCountriesEduVsPIB.jpg' alt="Investimento em Educação %PIB" width="700" height="700" style="float:left">

<img src='img/EduExpPerStudent.jpg' alt="Despesa por Aluno" width="700" height="700" style="float:left">

## 3.Definição das hipóteses

#### _O Brasil não investe o valor total alocado em Educação no Aluno, parte do investimento é direcionado para outros fins._

## 4.Análise e discussão dos dados

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import scipy as sp
from scipy.spatial.distance import pdist
from scipy.cluster.hierarchy import linkage, dendrogram

Importanto as bases de dados:

In [2]:
# PIB
df_PIB = pd.read_csv('Dados\OECD-PIB\PIB.csv')

#Gastos com Educação
df_OECD_EduExp = pd.read_csv('Dados\OECD-IndicadoresFinanceiros\education_expending.csv')
df_OECD_EduExpPub = pd.read_csv('Dados\OECD-IndicadoresFinanceiros\publicExpendingEdu.csv')
df_OECD_EduExpPriv = pd.read_csv('Dados\OECD-IndicadoresFinanceiros\privateExpendingEdu.csv')
df_OECD_FinRatio = pd.read_csv('Dados\OECD-IndicadoresFinanceiros\EAG_FIN_RATIO_CATEGORY_27102018185500362.csv')

#Nível Educação
df_PISA_MATH = pd.read_csv('Dados\OECD-NivelEdu\PISA_MATH.csv')
df_PISA_READ = pd.read_csv('Dados\OECD-NivelEdu\PISA_READ.csv')
df_PISA_SCIENCE = pd.read_csv('Dados\OECD-NivelEdu\PISA_SCIENCE.csv')
df_ADULT_EDU_LEVEL = pd.read_csv('Dados\OECD-NivelEdu\ADULT_EDU_LEVEL.csv')
df_POP_TERTIARY_EDU = pd.read_csv('Dados\OECD-NivelEdu\POP_TERTIARY_EDU.csv')

In [3]:
df_PISA_MATH.head()

  LOCATION INDICATOR SUBJECT    MEASURE FREQUENCY  TIME    Value  Flag Codes
0      AUS  PISAMATH     BOY  MEANSCORE         A  2003  527.000         NaN
1      AUS  PISAMATH     BOY  MEANSCORE         A  2006  527.000         NaN
2      AUS  PISAMATH     BOY  MEANSCORE         A  2009  519.000         NaN
3      AUS  PISAMATH     BOY  MEANSCORE         A  2012  510.115         NaN
4      AUS  PISAMATH     BOY  MEANSCORE         A  2015  497.000         NaN

In [4]:
df_PISA_MATH.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574 entries, 0 to 573
Data columns (total 8 columns):
LOCATION      574 non-null object
INDICATOR     574 non-null object
SUBJECT       574 non-null object
MEASURE       574 non-null object
FREQUENCY     574 non-null object
TIME          574 non-null int64
Value         574 non-null float64
Flag Codes    0 non-null float64
dtypes: float64(2), int64(1), object(5)
memory usage: 36.0+ KB

In [5]:
df_PISA_READ.head()

  LOCATION INDICATOR SUBJECT    MEASURE FREQUENCY  TIME   Value  Flag Codes
0      AUS  PISAREAD     BOY  MEANSCORE         A  2000  513.00         NaN
1      AUS  PISAREAD     BOY  MEANSCORE         A  2003  506.00         NaN
2      AUS  PISAREAD     BOY  MEANSCORE         A  2006  495.00         NaN
3      AUS  PISAREAD     BOY  MEANSCORE         A  2009  496.00         NaN
4      AUS  PISAREAD     BOY  MEANSCORE         A  2012  495.09         NaN

In [6]:
df_PISA_READ.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 664 entries, 0 to 663
Data columns (total 8 columns):
LOCATION      664 non-null object
INDICATOR     664 non-null object
SUBJECT       664 non-null object
MEASURE       664 non-null object
FREQUENCY     664 non-null object
TIME          664 non-null int64
Value         664 non-null float64
Flag Codes    0 non-null float64
dtypes: float64(2), int64(1), object(5)
memory usage: 41.6+ KB

In [7]:
df_PISA_SCIENCE.head()

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,AUS,PISASCIENCE,BOY,MEANSCORE,A,2006,527.000,NaN
1,AUS,PISASCIENCE,BOY,MEANSCORE,A,2009,527.000,NaN
2,AUS,PISASCIENCE,BOY,MEANSCORE,A,2012,523.728,NaN
3,AUS,PISASCIENCE,BOY,MEANSCORE,A,2015,511.000,NaN
4,AUS,PISASCIENCE,GIRL,MEANSCORE,A,2006,527.000,NaN

In [8]:
df_PISA_SCIENCE.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 474 entries, 0 to 473
Data columns (total 8 columns):
LOCATION      474 non-null object
INDICATOR     474 non-null object
SUBJECT       474 non-null object
MEASURE       474 non-null object
FREQUENCY     474 non-null object
TIME          474 non-null int64
Value         474 non-null float64
Flag Codes    0 non-null float64
dtypes: float64(2), int64(1), object(5)
memory usage: 29.7+ KB

In [9]:
df_PISA_MATH.drop(['MEASURE', 'FREQUENCY', 'Flag Codes'], axis=1, inplace=True)
df_PISA_READ.drop(['MEASURE', 'FREQUENCY', 'Flag Codes'], axis=1, inplace=True)
df_PISA_SCIENCE.drop(['MEASURE', 'FREQUENCY', 'Flag Codes'], axis=1, inplace=True)

In [10]:
df_PISA_MATH.head()

  LOCATION INDICATOR SUBJECT  TIME    Value
0      AUS  PISAMATH     BOY  2003  527.000
1      AUS  PISAMATH     BOY  2006  527.000
2      AUS  PISAMATH     BOY  2009  519.000
3      AUS  PISAMATH     BOY  2012  510.115
4      AUS  PISAMATH     BOY  2015  497.000

In [11]:
df_PISA_READ.head()

  LOCATION INDICATOR SUBJECT  TIME   Value
0      AUS  PISAREAD     BOY  2000  513.00
1      AUS  PISAREAD     BOY  2003  506.00
2      AUS  PISAREAD     BOY  2006  495.00
3      AUS  PISAREAD     BOY  2009  496.00
4      AUS  PISAREAD     BOY  2012  495.09

In [12]:
df_PISA = pd.concat([df_PISA_MATH, df_PISA_READ, df_PISA_SCIENCE], axis=0, join='outer', ignore_index=True)
df_PISA['PISA_AVER'] = ''
df_PISA.head()

  LOCATION INDICATOR SUBJECT  TIME    Value PISA_AVER
0      AUS  PISAMATH     BOY  2003  527.000
1      AUS  PISAMATH     BOY  2006  527.000
2      AUS  PISAMATH     BOY  2009  519.000
3      AUS  PISAMATH     BOY  2012  510.115
4      AUS  PISAMATH     BOY  2015  497.000

In [13]:
df_PISA.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1712 entries, 0 to 1711
Data columns (total 6 columns):
LOCATION     1712 non-null object
INDICATOR    1712 non-null object
SUBJECT      1712 non-null object
TIME         1712 non-null int64
Value        1712 non-null float64
PISA_AVER    1712 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 80.3+ KB

In [14]:
countries = df_PISA['LOCATION'].unique()
countries

array(['AUS', 'AUT', 'BEL', 'CAN', 'CZE', 'DNK', 'FIN', 'FRA', 'DEU',
       'GRC', 'HUN', 'ISL', 'IRL', 'ITA', 'JPN', 'KOR', 'LUX', 'MEX',
       'NLD', 'NZL', 'NOR', 'POL', 'PRT', 'SVK', 'ESP', 'SWE', 'CHE',
       'TUR', 'GBR', 'USA', 'BRA', 'CHL', 'EST', 'IDN', 'ISR', 'RUS',
       'SVN', 'OAVG', 'LVA', 'SGP', 'COL', 'HKG', 'PER', 'TWN', 'MAC'],
      dtype=object)

In [21]:
for country in countries:
    df_PISA[df_PISA.LOCATION==country].loc[:, 'PISA_AVER']= df_PISA[df_PISA.LOCATION==country]['Value'].mean()

df_PISA.sort_values(by='PISA_AVER',ascending=False, na_position='first', inplace=True)
df_PISA.reset_index(drop=True, inplace=True)
df_PISA.head()

  LOCATION    INDICATOR SUBJECT  TIME  Value PISA_AVER
0      SGP  PISASCIENCE     BOY  2015  559.0   551.667
1      SGP  PISASCIENCE     TOT  2015  556.0   551.667
2      SGP     PISAMATH     TOT  2015  564.0   551.667
3      SGP     PISAREAD    GIRL  2015  546.0   551.667
4      SGP     PISAREAD     BOY  2015  525.0   551.667

In [31]:
df_rank_PISA = df_PISA.drop(['INDICATOR', 'SUBJECT', 'TIME', 'Value'], axis=1)
df_rank_PISA.drop_duplicates(inplace=True)
df_rank_PISA.reset_index(drop=True, inplace=True)
df_rank_PISA.index = df_rank_PISA.index + 1
df_rank_PISA.head(10)

   LOCATION PISA_AVER
1       SGP   551.667
2       FIN   538.636
3       KOR   535.818
4       HKG   532.778
5       MAC   527.222
6       CAN   526.873
7       JPN   526.848
8       TWN   523.889
9       EST   519.947
10      NLD   517.829

In [30]:
plt.bar(height=df_rank_PISA['PISA_AVER'], x=height=df_rank_PISA['PISA_AVER'])

SyntaxError: invalid syntax (<ipython-input-30-e85eb3b8d471>, line 1)

In [37]:
df_OECD_EduExp.head()

  LOCATION INDICATOR SUBJECT      MEASURE FREQUENCY  TIME  Value Flag Codes
0      AUT    EDUEXP     TRY  USD_STUDENT         A  1995    NaN          M
1      AUT    EDUEXP     TRY  USD_STUDENT         A  2000    NaN          M
2      AUT    EDUEXP     TRY  USD_STUDENT         A  2005    NaN          M
3      AUT    EDUEXP     TRY  USD_STUDENT         A  2008    NaN          M
4      AUT    EDUEXP     TRY  USD_STUDENT         A  2009    NaN          M

In [38]:
df_OECD_EduExp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5401 entries, 0 to 5400
Data columns (total 8 columns):
LOCATION      5401 non-null object
INDICATOR     5401 non-null object
SUBJECT       5401 non-null object
MEASURE       5401 non-null object
FREQUENCY     5401 non-null object
TIME          5401 non-null int64
Value         2507 non-null float64
Flag Codes    2894 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 337.6+ KB

In [ ]:
# Verificar a lista de países
lista_paises=df_OECD_EduExp['LOCATION'].unique()
lista_paises

In [ ]:
# Verifcar a lista das outras colunas
columns = ['INDICATOR', 'SUBJECT', 'MEASURE', 'FREQUENCY', 'TIME']

ValueUnique = []
for column in columns:
    ValueUnique.append(df_OECD_EduExp[column].unique())

df_column_type = pd.DataFrame(ValueUnique, index=columns).T

df_column_type

#### A respeito da Educação, os dados estão divididos em: 

SUBJECT:
* 'TRY' = Ensino Terciário ou Universitário
* 'PRY'= Ensino Primário
* 'EARLYCHILDEDU'= Jardim da Infância
* 'PRY_NTRY' = Ensino Primario até após o secundário, não Universitário
* 'SRY' = Ensino Secundário

MEASURE:
* 'USD_STUDENT' = Gasto em dólares por estudante
* 'PC_GDP' = Gasto em educação relativo ao PIB

Vamos explorar os dados em cada etapa da Educação

In [ ]:
df_JardInfancia=df_OECD_EduExp[(df_OECD_EduExp['SUBJECT']=='EARLYCHILDEDU')]
df_EduPrim=df_OECD_EduExp[(df_OECD_EduExp['SUBJECT']=='PRY')]
df_EduSec=df_OECD_EduExp[(df_OECD_EduExp['SUBJECT']=='SRY')]
df_EduPosSec=df_OECD_EduExp[(df_OECD_EduExp['SUBJECT']=='PRY_NTRY')]
df_EduTerc = df_OECD_EduExp[(df_OECD_EduExp['SUBJECT']=='TRY')]

In [ ]:
df_OECD_EduExp.groupby(['LOCATION','MEASURE'])['Value'].mean())

## 5.Bibiografia

[1] https://data.oecd.org/eduresource/public-spending-on-education.htm